## Plan Result (test-appgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.appgateway.azurerm_public_ip.app_gw[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories"  {
      ~ id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw" -> (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      ~ logs                = [
          - "ApplicationGatewayAccessLog",
          - "ApplicationGatewayFirewallLog",
          - "ApplicationGatewayPerformanceLog",
        ] -> (known after apply)
      ~ metrics             = [
          - "AllMetrics",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.appgateway.azurerm_public_ip.app_gw[0] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/publicIPAddresses/aks-fe-appgw-test-pip"
        name                    = "aks-fe-appgw-test-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-test-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      + log {
          + category = "ApplicationGatewayAccessLog"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + log {
          + category = "ApplicationGatewayFirewallLog"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + log {
          + category = "ApplicationGatewayPerformanceLog"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":173,"Program":"tfcmt","SHA1":"","Target":"test-appgateway","Vars":{}} -->